def get_perspective_param(bill_type_id):
    """查找 bill_type_id 对应票据的矫正参数

    :param bill_type_id: 票据类型 ID
    :type img_id: str

    :rtype: dict
    """

    # 模拟返回 bill_type_id = "sh-invoice" 对应的矫正参数
    # 矫正参数 dsize: 矫正后图像的大小，(width, height)
    # 矫正参数 dst: 矫正目标矩阵，[右上角, 左上角, 左下角, 右下角]

    if bill_type_id == "sh-invoice":
        return {"dsize": (1640, 1000), "dst": [[1466, 192], [168, 192], [168, 898], [1466, 898]]}

    return None


def get_segmentation_param(bill_type_id):
    """查找 bill_type_id 对应票据的矫正参数

    :param bill_type_id: 票据类型 ID
    :type img_id: str

    :rtype: dict
    """

    # 模拟返回 bill_type_id == "sh-invoice" 对应的分割参数
    # 每个切片的 Rect 由: (left, top, width, height) 决定
    # 票据幅面: (0, 0, 1640, 1000)
    # 票据类型: (680, 45, 650, 120)
    # 医院名称：(135, 66, 880, 100)
    # 收款单位：(145, 882, 550, 72)
    # 医院类别：(530, 135, 620, 72)
    # 业务流水号: (148, 132, 375, 72)
    # 发票号: (1155, 135, 340, 72)
    # 姓名: (155, 178, 295, 72)
    # 性别: (435, 178, 120, 72)
    # 医保类型: (525, 178, 445, 72)
    # 社会保障号: (975, 178, 470, 72)
    # 合计金额: (155, 535, 515, 72)
    # 现金支付: (155, 577, 245, 72)
    # 个人账户支付: (375, 577, 290, 72)
    # 医保统筹支付: (155, 621, 245, 72)
    # 附加支付: (375, 621, 290, 72)
    # 分类自负: (155, 660, 352, 72)
    # 自负: (485, 660, 185, 72)
    # 自费: (155, 703, 235, 72)
    # 诊疗项目小计: (155, 220, 520, 340)
    # 诊疗项目明细: (645, 220, 835, 600)

    if bill_type_id == "sh-invoice":
        sh_invoice_segmentation_param = [
            {"name": "票据幅面", "rect": (0, 0, 1640, 1000)},
            {"name": "票据类型", "rect": (680, 45, 650, 120)},
            {"name": "医院名称", "rect": (135, 66, 880, 100)},
            {"name": "收款单位", "rect": (145, 882, 550, 72)},
            {"name": "医院类别", "rect": (530, 135, 620, 72)},
            {"name": "业务流水号", "rect": (148, 132, 375, 72)},
            {"name": "发票号", "rect": (1155, 135, 340, 72)},
            {"name": "姓名", "rect": (155, 178, 295, 72)},
            {"name": "性别", "rect": (435, 178, 120, 72)},
            {"name": "医保类型", "rect": (525, 178, 445, 72)},
            {"name": "社会保障号", "rect": (975, 178, 470, 72)},
            {"name": "合计金额", "rect": (155, 535, 515, 72)},
            {"name": "现金支付", "rect": (155, 577, 245, 72)},
            {"name": "个人账户支付", "rect": (375, 577, 290, 72)},
            {"name": "医保统筹支付", "rect": (155, 621, 245, 72)},
            {"name": "附加支付", "rect": (375, 621, 290, 72)},
            {"name": "分类自负", "rect": (155, 660, 352, 72)},
            {"name": "自负", "rect": (485, 660, 185, 72)},
            {"name": "自费", "rect": (155, 703, 235, 72)},
            {"name": "诊疗项目小计", "rect": (155, 220, 520, 340)},
            {"name": "诊疗项目明细", "rect": (645, 220, 835, 600)},
        ]
        return sh_invoice_segmentation_param

    return None
